w6d5/99_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "bloodtype"], ["updated_at", "2020-07-13 04:11:27.323614"], ["id", 4]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)