w6d3/routes_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "bob4@bob.com"], ["updated_at", "2020-07-08 22:33:27.440284"], ["id", 3]]
---
  def update
    user = User.find(params[:id])
    user.update!(params.require(:user).permit(:name, :email))

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find(params[:id])
    user.destroy!