w7d2/music_app/app/controllers/users_controller.rb

    def create
        #debugger
        @user = User.new(user_params)
        if @user.save!
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"