w6d4/routes_controllers/app/controllers/artworks_controller.rb

    def index
        # render json: Artwork.all
        owned_artworks = Artwork.where(artist_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 AND "artworks"."id" = $2  [["artist_id", 1], ["id", 1]]