w6d4/routes_controllers/app/controllers/comments_controller.rb

    def index
        case
        when params[:user_id]
            comment = Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
            comment = Comment.where(artwork_id: params[:artwork_id])
        else
            comment = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comments_params)
        if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "\"sweet art!"], ["user_id", 1], ["artwork_id", 2], ["created_at", "2020-07-09 21:30:02.422196"], ["updated_at", "2020-07-09 21:30:02.422196"]]

    def destroy
        comment = Comment.find(params[:id])
        comment.destroy!
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]