w6d4/routes_controllers/app/controllers/users_controller.rb

  def index
    # debugger

    if params[:query]
      user = User.where("username LIKE '%#{params[:query]}%' ")
    else
      user = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%robert%' )

  def update
    user = User.find(params[:id])
    if user
      user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "bobinsonson"], ["updated_at", "2020-07-09 18:09:03.883022"], ["id", 3]]

  def destroy
    user = User.find(params[:id])
    user.destroy!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]